hussainaloum/STM32-Embedded-Drivers/drivers/inc/stm32f439zi_spi_driver.h
/*
 * stm32f439zi_spi_driver.h
 *
 *  Created on: Nov 16, 2021
 *      Author: ha
 */

#ifndef INC_STM32F439ZI_SPI_DRIVER_H_
#define INC_STM32F439ZI_SPI_DRIVER_H_

#include "stm32f439zi.h"


/* This is a Configuration structure for a SPI communication protocol */

typedef struct
{
	uint8_t	SPI_DeviceMode;
	uint8_t SPI_BusConfig;
	uint8_t	SPI_SclkSpeed;
	uint8_t SPI_DFF;
	uint8_t SPI_CPOL;
	uint8_t	SPI_CPHA;
	uint8_t SPI_SSM;
}SPI_Config_t;

typedef struct
{
	SPI_RegDef_t	*pSPIx;
	SPI_Config_t	SPIConfig;
	uint8_t			*pTxBuffer;		//To store the app. Tx buffer address
	uint8_t			*pRxBuffer;		//To store the app. Rx buffer address
	uint32_t		TxLen;			//To store the Tx length
	uint32_t		RxLen;			//To store the Rx length
	uint8_t			TxState;		//To store the Tx state
	uint8_t			RxState;		//To store the Rx state
}SPI_Handle_t;

/*
 * SPI application state (for interrupt)
 *
 * @TxState
 * @RXState
 * */
#define SPI_READY			0
#define SPI_BUSY_IN_RX		1
#define SPI_BUSY_IN_TX		2

/*
 * Possible SPI application events
 * */
#define SPI_EVENT_TX_CMPLT	1
#define SPI_EVENT_RX_CMPLT	2
#define SPI_EVENT_OVR_ERR	3


/************************************* Macros *******************************/

/* @SPI_DeviceMode */
#define SPI_DEVICE_MODE_MASTER	1
#define SPI_DEVICE_MODE_SLAVE	0

/* @SPI_BusConfig */
#define SPI_BUS_CONFIG_FD				1
#define SPI_BUS_CONFIG_HD				2
//#define SPI_BUS_CONFIG_SIMPLEX_TXONLY	3				Not needed, same as SPI_BUS_CONFIG_FD
#define SPI_BUS_CONFIG_SIMPLEX_RXONLY	3

/* @SPI_SclkSpeed */
#define SPI_SCLK_SPEED_DIV2				0
#define	SPI_SCLK_SPEED_DIV4				1
#define SPI_SCLK_SPEED_DIV8				2
#define SPI_SCLK_SPEED_DIV16			3
#define SPI_SCLK_SPEED_DIV32			4
#define SPI_SCLK_SPEED_DIV64			5
#define SPI_SCLK_SPEED_DIV128			6
#define SPI_SCLK_SPEED_DIV256			7

/* @SPI_DFF */
#define SPI_DFF_8BITS					0
#define SPI_DFF_16BITS					1

/* @SPI_CPOL */
#define SPI_CPOL_HIGH					1
#define SPI_CPOL_LOW					0

/* @SPI_CPHA */
#define SPI_CPHA_HIGH					1
#define SPI_CPHA_LOW					0

/* @SPI_SSM */
#define SPI_SSM_EN						1
#define SPI_SSM_DI						0

/* SPI related status flags definitions */
#define SPI_TXE_FLAG					(1 << SPI_SR_TXE_BIT_POS)
#define SPI_RXNE_FLAG					(1 << SPI_SR_RXNE_BIT_POS)
#define SPI_BUSY_FLAG					(1 << SPI_SR_BSY_BIT_POS)

/**************************************
 	 APIs supported by this SPI driver
 **************************************/

/* Peripheral Clock Setup */
void SPI_PeriClockControl(SPI_RegDef_t *pSPIx, uint8_t ENorDi);

/* Init and De-Init */
void SPI_Init(SPI_Handle_t *pSPIHandle);
void SPI_DeInit(SPI_RegDef_t *pSPIx);

/*
 * Data send and receive
 * */
void SPI_SendData(SPI_RegDef_t *pSPIx, uint8_t *pTxBuffer, uint32_t length);
void SPI_ReceiveData(SPI_RegDef_t *pSPIx, uint8_t *pRxBuffer, uint32_t length);
uint8_t SPI_SendDataWithIT(SPI_Handle_t *pSPIHandle, uint8_t *pTxBuffer, uint32_t length);			//For use with interrupt
uint8_t SPI_ReceiveDataWithIT(SPI_Handle_t *pSPIHandle, uint8_t *pRxBuffer, uint32_t length);		//For use with interrupt

/*
 * IRQ Configuration and ISR handling
 * */
void SPI_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi);
void SPI_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);
void SPI_IRQHandling(SPI_Handle_t *pHandle);

/*
 * Other Peripheral control APIs
 * */
bool SPI_GetFlagStatus(SPI_RegDef_t *pSPIx, uint32_t FlagName);
void SPI_PeripheralControl(SPI_RegDef_t *pSPIx, uint8_t ENorDI);
void SPI_SSIConfig(SPI_RegDef_t *pSPIx, uint8_t ENorDI);
void SPI_SSOEConfig(SPI_RegDef_t *pSPIx, uint8_t ENorDI);
void SPI_ClearOVRFlag(SPI_RegDef_t *pSPIx);
void SPI_CloseTransmission(SPI_Handle_t *pSPIHandle);
void SPI_CloseReception(SPI_Handle_t *pSPIHandle);

/*
 * Application callback
 * */
void SPI_ApplicationEventCallback(SPI_Handle_t *pSPIHandle, uint8_t AppEvent);

#endif /* INC_STM32F439ZI_SPI_DRIVER_H_ */
